# StairIncompleteFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairIncompleteFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Stair element is incomplete, not all components are logic connected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairIncompleteFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairIncompleteFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairIncompleteFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace